import requests


l = """
 __       __  ________  __    __   ______  
/  |  _  /  |/        |/  |  /  | /      \ 
$$ | / \ $$ |$$$$$$$$/ $$ |  $$ |/$$$$$$  |
$$ |/$  \$$ |$$ |__    $$  \/$$/ $$ |  $$ |
$$ /$$$  $$ |$$    |    $$  $$<  $$ |  $$ |
$$ $$/$$ $$ |$$$$$/      $$$$  \ $$ |_ $$ |
$$$$/  $$$$ |$$ |_____  $$ /$$  |$$ / \$$ |
$$$/    $$$ |$$       |$$ |  $$ |$$ $$ $$< 
$$/      $$/ $$$$$$$$/ $$/   $$/  $$$$$$  |
                                      $$$/ 
"""
                                      
                                    
print(l)
                                                                                                                               
                                                                                                        

sori = input("𝐒𝐨𝐫𝐠𝐮 𝐂𝐞𝐤𝐢𝐥𝐞𝐜𝐞𝐤 𝐢𝐩 𝐚𝐝𝐞𝐫𝐬𝐢𝐧 𝐆𝐢𝐫:   ")

ap = f'https://tilki.dev/api/ip/{sori}'


response = requests.get(ap)

diti = response.json()

s = diti['city']
r = diti['region']
c = diti['country']
p = diti['postal']
t = diti['timezone']

print(f'𝐢𝐩 {sori}\nÜ𝐥𝐤𝐞: {s}\n𝐁ö𝐥𝐠𝐞: {r} \n𝐏𝐨𝐬𝐭𝐚: {p}\n𝐒𝐚𝐚𝐭 𝐝𝐢𝐥𝐢𝐦𝐢: {s}\n𝐓𝐞𝐥𝐞𝐠𝐫𝐚𝐦: 𝐭.𝐦𝐞/𝐰𝐞𝐱𝐪0 / 𝐭.𝐦𝐞/𝐰𝐞𝐱𝐪0𝐩𝐲𝐭𝐡𝐨𝐧')
